# Rebar Shape Create Method

Source: https://www.revitapidocs.com/2026/dd926f0a-458d-d64d-1c85-07f3d2c68baa.htm

---

| Rebar Shape Create Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarShapeTerminationsData) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32\) | **Obsolete.** Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId) | **Obsolete.** Create a new instance of a Rebar Shape, which defines the shape of a rebar. |

Top See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace